// Для проверки работы нужной программы нужно выделить код и нажать сочетание кнопок "Ctrl+/",
// далее ввести команду "dotnet run" в терминале

// ===============================================================

// Задача 25: Напишите цикл, который принимает на вход два числа 
// (A и B) и возводит число A в натуральную степень B.

// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

// Решение: 

// Console.WriteLine("Введите число A: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите число B: ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine($"Результат возведения числа {num1} в степнь {num2}: {Math.Pow(num1, num2)}");

// ===============================================================

// Задача 27: Напишите программу, которая принимает на вход число 
// и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

// Решение:

